20211201174425-les_10_les_plus_riches_ne_gagnent_que_3_5x_plus_que_les_10_les_plus_pauvres.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-30 Thu 07:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Les 10% les plus riches ne gagnent que 3.5x plus que les 10% les plus pauvres</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Les 10% les plus riches ne gagnent que 3.5x plus que les 10% les plus pauvres</h1>
<p>
Une petite statistique récurrente que l'on entend ici et là sur les plateaux de télévision dès que pointe le sujet des inégalités en France. Prenons X Babeau de l'institut Sapiens, par exemple:
</p>

<blockquote>
<p>
La France est un des pays les plus égalitaires d'Europe, les 10% les plus riches ne gagnent que 3.5x plus que les 10% les moins riches.
</p>
</blockquote>

<p>
C'est inexact, et fallacieux. La statistique vient d'une étude de l'INSEE sur
les revenus des ménages de 2018. Ce que l'INSEE dit est que le revenu
corresponant au 9e décile (à droite duquel on à les 10% les plus riches) est
égal à 3,5 fois celui correspondant au 1er décile (en-dessous duquel on trouve
les 10% les moins riches).
</p>


<div id="outline-container-org420dffb" class="outline-2">
<h2 id="org420dffb">Pourquoi est-ce fallacieux?</h2>
<div class="outline-text-2" id="text-org420dffb">
<p>
Les déciles correspondent à une répartition de la <span class="underline">population</span> à parts égales. En 2018, le niveau de vie correspondant au 1er décile après redistribution est de \\(97,1\\). Imaginons que la population française soit de 100 personnes. Les 3 configuration suivantes donnent la meme valeur de 97,1:
</p>

<ul class="org-ul">
<li>[1, 1, 1, 1, 1, 1, 1, 1, 1, 97.1]</li>
<li>[10, 20, 30, 40, 50, 70, 80, 90, 92, 97.1]</li>
<li>[97.1, 97.1, 97.1, 97.1, 97.1, 97.1, 97.1, 97.1, 97.1, 97.1]</li>
</ul>

<p>
Pas du tout la même réalité, n'est-ce pas? De la même manière pour le 9e décile, le niveau de vie des plus riches peut-être concentré près du décile, ou être arbitrairement grande. Vous imaginez que le chiffre de 3.5 est totalement arbitraire, et ne représente pas comme les commentateurs le disent la différence de niveau de vie entre les 10% les plus pauvres et les 10% les plus riches.
</p>
</div>
</div>


<div id="outline-container-org2ea63d4" class="outline-2">
<h2 id="org2ea63d4">Peut-on faire mieux ?</h2>
<div class="outline-text-2" id="text-org2ea63d4">
<p>
Oui ! Arrêtons-nous deux minutes pour réfléchir à la quantité que l'on veut vraiment mesurer ici. Déjà reformulons en terme de niveau de vie, puisque c'est bien ce dont les statistiques de l'INSEE parlent:
</p>

<blockquote>
<p>
Le niveau de vie des 10% les plus riches n'est que 3.5 fois plus élevé que celui des 10% les moins riches
</p>
</blockquote>

<p>
Si nous avions le niveau de vie de chacun des ménages français individuellement, nous pourrions pour calculer pour chaque paire \\((m\_1, m\_9)\\) de ménages respectivement dans le premier et le 9e décile le rapport de niveau de vie. La moyenne nous donnerait:
</p>

<blockquote>
<p>
Le niveau de vie des 10% les plus riches n'est en moyenne que X fois plus élevé que celui des 10% les moins riches
</p>
</blockquote>

<p>
Mais nous n'avons pas accès à ces données. Ce n'est pas grave! Nous pouvons ajuster une distribution à
</p>
</div>


<div id="outline-container-orgf03d97f" class="outline-3">
<h3 id="orgf03d97f">Données de l'INSEE</h3>
<div class="outline-text-3" id="text-orgf03d97f">
<ul class="org-ul">
<li><a target='_blank' rel='noopener noreferrer' class='external' href="https://www.insee.fr/fr/statistiques/2011101?geo=METRO-1#chiffre-cle-8">https://www.insee.fr/fr/statistiques/2011101?geo=METRO-1#chiffre-cle-8</a>
Il y a 27,510,608 ménages en France en 2018</li>

<li><p>
<a target='_blank' rel='noopener noreferrer' class='external' href="https://www.insee.fr/fr/statistiques/4659174#figure1%5Fradio1">https://www.insee.fr/fr/statistiques/4659174#figure1%5Fradio1</a>
Ca c'est en 2018, mais impossible de récupérer le niveau de vie median. En revanche on peut trouver les chiffres pour 2015:
</p>

<p>
tableaux de l'économie française 2018
</p></li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Décile</th>
<th scope="col" class="org-right">Avant redistribution</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">D1</td>
<td class="org-right">10860</td>
</tr>

<tr>
<td class="org-left">Mediane</td>
<td class="org-right">20300</td>
</tr>

<tr>
<td class="org-left">D9</td>
<td class="org-right">37510</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">order_statistics</span>(num_points, quantiles, ):
    <span style="font-weight: bold; font-style: italic;">logpdf</span> = 0
    <span style="font-weight: bold; font-style: italic;">logpdf</span> += gammaln(N+1) - gammaln(N * q[0]) - gammaln(N - N * q[-1] + 1)
    <span style="font-weight: bold; font-style: italic;">logpdf</span> += (N * q[0] - 1) * log(U[0])
    <span style="font-weight: bold; font-style: italic;">logpdf</span> += (N-N*q[-1])*log(1-U[-1])
    <span style="font-weight: bold;">for</span> val <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(1,M):
        <span style="font-weight: bold; font-style: italic;">logpdf</span> +=
<span style="font-style: italic;">"""</span>
<span style="font-style: italic;">real orderstatistics(int N, int M, vector q, vector U){</span>
<span style="font-style: italic;">    real lpdf = 0;</span>
<span style="font-style: italic;">    lpdf += lgamma(N+1) - lgamma(N*q[1]) - lgamma(N-N*q[M]+1);</span>
<span style="font-style: italic;">    lpdf += (N*q[1]-1)*log(U[1]);</span>
<span style="font-style: italic;">    lpdf += (N-N*q[M])*log(1-U[M]);</span>
<span style="font-style: italic;">    for (m in 2:M){</span>
<span style="font-style: italic;">        lpdf += -lgamma(N*q[m]-N*q[m-1]);</span>
<span style="font-style: italic;">        lpdf += (N*q[m]-N*q[m-1]-1)*log(U[m]-U[m-1]);</span>
<span style="font-style: italic;">    }</span>
<span style="font-style: italic;">    return lpdf;</span>
<span style="font-style: italic;">"""</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">
<span style="font-weight: bold;">import</span> pymc3 <span style="font-weight: bold;">as</span> pm

<span style="font-weight: bold;">with</span> pm.Model() <span style="font-weight: bold;">as</span> curve_fitting:
    <span style="font-weight: bold; font-style: italic;">stat</span> = pm.Factor((aaaaa))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf634c1a" class="outline-3">
<h3 id="orgf634c1a">Pourquoi c'est faux</h3>
</div>

<div id="outline-container-org0c2fde2" class="outline-3">
<h3 id="org0c2fde2">Méthodologie</h3>
</div>

<div id="outline-container-orgf5578f4" class="outline-3">
<h3 id="orgf5578f4">References</h3>
<div class="outline-text-3" id="text-orgf5578f4">
<ul class="org-ul">
<li>Vidéo avec Boulo et Babeau</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf497bf8" class="outline-2">
<h2 id="orgf497bf8">Links to this note</h2>
<div class="outline-text-2" id="text-orgf497bf8">
<ul class="org-ul">
<li><a href="./20211201174631-doxa.html">Doxa</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
